In [1]:
# Dependencies
import pandas as pd

In [10]:
# Name of the CSV file
file = '../Resources/donors2008.csv'

In [11]:
# The correct encoding must be used to read the CSV in pandas
df = pd.read_csv(file, encoding="ISO-8859-1")

In [12]:
# Preview of the DataFrame
# Note that FIELD8 is likely a meaningless column
df.head()

  LastName FirstName          Employer      City State    Zip  Amount  FIELD8
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0     NaN
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0     NaN
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0     NaN
3    Adams  Lorraine              Self  New York    NY  10026   200.0     NaN
4    Adams    Marion              None    Exeter    NH  03833   100.0     NaN

In [13]:
# Delete extraneous column
del df['FIELD8']
df.head()

  LastName FirstName          Employer      City State    Zip  Amount
0    Aaron    Eugene  State Department    Dulles    VA  20189   500.0
1    Abadi   Barbara       Abadi & Co.  New York    NY  10021   200.0
2  Adamany   Anthony           Retired  Rockford    IL  61103   500.0
3    Adams  Lorraine              Self  New York    NY  10026   200.0
4    Adams    Marion              None    Exeter    NH  03833   100.0

In [14]:
# Identify incomplete rows
df.count()

LastName     1776
FirstName    1776
Employer     1743
City         1776
State        1776
Zip          1776
Amount       1776
dtype: int64

In [15]:
# Drop all rows with missing information
df = df.dropna(how='any')

In [16]:
# Verify dropped rows
df.count()

LastName     1743
FirstName    1743
Employer     1743
City         1743
State        1743
Zip          1743
Amount       1743
dtype: int64

In [17]:
# The Amount column is the wrong data type. It should be numeric.
df.dtypes

LastName      object
FirstName     object
Employer      object
City          object
State         object
Zip           object
Amount       float64
dtype: object

In [18]:
# Use pd.to_numeric() method to convert the datatype of the Amount column
df['Amount'] = pd.to_numeric(df['Amount'])

In [19]:
# Verify that the Amount column datatype has been made numeric
df['Amount'].dtype

dtype('float64')

In [20]:
# Display an overview of the Employers column
df['Employer'].value_counts()

None                               249
Self                               241
Retired                            126
Self Employed                       39
Self-Employed                       34
                                  ...
Jobvite                              1
Early McClintic & McMillan, LLP      1
Patrick DeCarolis, Jr. APLC          1
Adler Group, Inc.                    1
Lion Oaks Ranch                      1
Name: Employer, Length: 1011, dtype: int64

In [21]:
# Clean up Employer category. Replace 'Self Employed' and 'Self' with 'Self-Employed'
df['Employer'] = df['Employer'].replace(
    {'Self Employed': 'Self-Employed', 'Self': 'Self-Employed'})

In [22]:
# Verify clean-up.
df['Employer'].value_counts()

Self-Employed                      314
None                               249
Retired                            126
Google                               6
Unemployed                           4
                                  ...
Jobvite                              1
Early McClintic & McMillan, LLP      1
Patrick DeCarolis, Jr. APLC          1
Adler Group, Inc.                    1
Lion Oaks Ranch                      1
Name: Employer, Length: 1009, dtype: int64

In [23]:
df['Employer'] = df['Employer'].replace({'Not Employed': 'Unemployed'})
df['Employer'].value_counts()

Self-Employed                      314
None                               249
Retired                            126
Unemployed                           8
Google                               6
                                  ...
Jobvite                              1
Early McClintic & McMillan, LLP      1
Patrick DeCarolis, Jr. APLC          1
Adler Group, Inc.                    1
Lion Oaks Ranch                      1
Name: Employer, Length: 1008, dtype: int64

In [24]:
df

,LastName,FirstName,Employer,City,State,Zip,Amount
0,Aaron,Eugene,State Department,Dulles,VA,20189,500.0
1,Abadi,Barbara,Abadi & Co.,New York,NY,10021,200.0
2,Adamany,Anthony,Retired,Rockford,IL,61103,500.0
3,Adams,Lorraine,Self-Employed,New York,NY,10026,200.0
4,Adams,Marion,None,Exeter,NH,03833,100.0
...,...,...,...,...,...,...,...
1769,Zeluf,Craig,TD Ameritrade,Omaha,NE,68118,250.0
1770,Zimmer,Charles,RZO LLC / QED Productions,Atlanta,GA,30307,250.0
1771,Zinczenko,David,Rodale,Allentown,PA,18102,500.0
1774,Zwerdling,David,"Montg Cnty, Md",Silver Spring,MD,20910,35.0
1775,Zyskind,Jon,JDS Uniphase,Concord,MA,10742,25.0

In [16]:
# Display a statistical overview
# We can infer the maximum allowable individual contribution from 'max'
df.describe()

            Amount
count  1743.000000
mean    640.124750
std    1242.343265
min       5.000000
25%     200.000000
50%     250.000000
75%     500.000000
max    5000.000000